ЯМБух.ЯндексМаршрутизация/src/Catalogs/ЯМ_ТранспортныеСредства/ЯМ_ТранспортныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЯМ_ТранспортныеСредства</name>
  <attributes>
    <name>ЛогинКурьера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Работает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоподъемность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьФикс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаРейс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартНеНаСкладе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершениеНеНаСкладе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаТочкиСтарта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаТочкиСтарта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаТочкиЗавершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаТочкиЗавершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПеремещения</name>
    <type>
      <types>EnumRef.ЯМ_СпособПеремещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаехатьНаСкладВНачалеМаршрута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаехатьНаСкладВКонцеМаршрута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВременноеОкноТочкаСтарта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВременноеОкноТочкаОкончания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтарта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗавершения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтартаЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтартаЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректировкаВремениДвиженияАвтомобиля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.ЯМ_Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Смены</name>
    <attributes>
      <name>ВременноеОкно</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаБалансировки</name>
      <type>
        <types>CatalogRef.ЯМ_ГруппыБалансировки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЖесткоеВременноеОкно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрафы</name>
      <type>
        <types>CatalogRef.ЯМ_НастройкиШтрафовДляАлгоритмов</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеКоличествоСтопов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеКоличествоСтопов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйПробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяПродолжительностьСмены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЯМБух.ЯндексМаршрутизация/src/Catalogs/ЯМ_ТранспортныеСредства/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоНовый = Объект.Ссылка.Пустая();
	
	Если ЭтоНовый Тогда
		Объект.СтоимостьКМ   = 8;
		Объект.СтоимостьЧас  = 100;
		Объект.СтоимостьФикс = 3000;
		Объект.КоличествоРейсов = 1;
		Объект.КорректировкаВремениДвиженияАвтомобиля = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Смены.Количество() = 0 Тогда 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У машины должна быть создана хотя бы одна смена!";
		Сообщение.Поле = Элементы.Смены;
		Сообщение.Сообщить();
	КонецЕсли;	
	
	Если ПроверитьДубли() Тогда 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У машины должен быть уникальный логин курьера!";
		Сообщение.Поле = Элементы.ЛогинКурьера;
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Объект.СтартНеНаСкладе Тогда 
		Если НЕ ЗначениеЗаполнено(Объект.ШиротаТочкиСтарта) Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При включенной настройке Старт не на складе поле 
			|Широта точки старта должно быть заполнено!";
			Сообщение.Поле = Элементы.ШиротаТочкиСтарта;
			Сообщение.Сообщить();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ДолготаТочкиСтарта) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При включенной настройке Старт не на складе поле 
			|Долгота точки старта должно быть заполнено!";
			Сообщение.Поле = Элементы.ДолготаТочкиСтарта;
			Сообщение.Сообщить();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ВременноеОкноТочкаСтарта) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При включенной настройке Старт не на складе поле 
			|Временное окно точки старта должно быть заполнено!";
			Сообщение.Поле = Элементы.ВременноеОкноТочкаСтарта;
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;

	Если Объект.ЗавершениеНеНаСкладе Тогда 
		Если НЕ ЗначениеЗаполнено(Объект.ШиротаТочкиЗавершения) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При включенной настройке Завершение не на складе поле 
			|Широта точки завершения должно быть заполнено!";
			Сообщение.Поле = Элементы.ШиротаТочкиСтарта;
			Сообщение.Сообщить();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ДолготаТочкиЗавершения) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При включенной настройке Завершение не на складе поле 
			|Долгота точки завершения должно быть заполнено!";
			Сообщение.Поле = Элементы.ДолготаТочкиСтарта;
			Сообщение.Сообщить();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ВременноеОкноТочкаОкончания) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При включенной настройке Завершение не на складе поле 
			|Временное окно точки завершения должно быть заполнено!";
			Сообщение.Поле = Элементы.ВременноеОкноТочкаСтарта;
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДубли()
	
	ДублиЕсть = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЯМ_ТранспортныеСредства.ЛогинКурьера КАК ЛогинКурьера
	|ИЗ
	|	Справочник.ЯМ_ТранспортныеСредства КАК ЯМ_ТранспортныеСредства
	|ГДЕ
	|	НЕ ЯМ_ТранспортныеСредства.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если ВРег(Выборка.ЛогинКурьера) = ВРег(Объект.ЛогинКурьера) Тогда 
			ДублиЕсть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ДублиЕсть;
	
КонецФункции

&НаКлиенте
Процедура СтартНеНаСкладеПриИзменении(Элемент)
	
	ОбновитьОформлениеПолейТочкиСтарта();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеНеНаСкладеПриИзменении(Элемент)
	ОбновитьОформлениеПолейТочкиЗавершения();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОформлениеПолейТочкиСтарта()
	
	СтартНеНаСкладе = Объект.СтартНеНаСкладе;
	Элементы.ШиротаТочкиСтарта.ОтметкаНезаполненного 		= СтартНеНаСкладе И 
																НЕ ЗначениеЗаполнено(Объект.ШиротаТочкиСтарта);
	Элементы.ДолготаТочкиСтарта.ОтметкаНезаполненного 		= СтартНеНаСкладе И 
																НЕ ЗначениеЗаполнено(Объект.ДолготаТочкиСтарта);
	Элементы.ВременноеОкноТочкаСтарта.ОтметкаНезаполненного = СтартНеНаСкладе И 
																НЕ ЗначениеЗаполнено(Объект.ВременноеОкноТочкаСтарта);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОформлениеПолейТочкиЗавершения()

	ЗаврешениеНеНаСкладе = Объект.ЗавершениеНеНаСкладе;
	Элементы.ШиротаТочкиЗавершения.ОтметкаНезаполненного 		= ЗаврешениеНеНаСкладе И 
															НЕ ЗначениеЗаполнено(Объект.ШиротаТочкиЗавершения);
	Элементы.ДолготаТочкиЗавершения.ОтметкаНезаполненного 		= ЗаврешениеНеНаСкладе И 
															НЕ ЗначениеЗаполнено(Объект.ДолготаТочкиЗавершения);
	Элементы.ВременноеОкноТочкаОкончания.ОтметкаНезаполненного 	= ЗаврешениеНеНаСкладе И 
															НЕ ЗначениеЗаполнено(Объект.ВременноеОкноТочкаОкончания);
	
КонецПроцедуры
